Repository: pypi-data/pypi-mirror-296
Catalog: packages/collective.classification.folder/collective.classification.folder-1.2.0-py3-none-any.whl/collective/classification/folder/locales/*/LC_MESSAGES/collective.classification.folder.po
Languages: fr

source: A classification folder's position in its hierarchy
fr: Position d'une farde dans sa hiérarchie

source: Annexes Types
fr: Types d'annexes

source: Archived
fr: Archivé

source: Archived folder
fr: Archivé pour la farde

source: Archived subfolder
fr: Archivé pour la chemise

source: Cannot find treating_groups title '${title}'
fr: Le nom du service traitant fourni <${title}> n'a pas été trouvé

source: Classification Config
fr: Gestion de dossiers

source: Classification Folder
fr: Farde

source: Classification Folders
fr: Dossiers

source: Classification Subfolder
fr: Chemise

source: Classification Subfolders
fr: Chemises de la farde

source: Classification categories
fr: Codes de classement

source: Classification folder faceted configuration
fr: Config dashboard farde

source: Classification folder sort
fr: Tri des fardes

source: Classification folders
fr: Dossiers

source: Classification identifier
fr: Identifiant unique

source: Classification informations
fr: Informations

source: Container for Classification Folder elements
fr: Contenant pour les fardes

source: Edit
fr: Modifier

source: Equivalent to a paper binder
fr: Représente une farde

source: Equivalent to a paper folder
fr: Représente une chemise

source: Folder Informations
fr: Informations de la farde

source: Folder Name
fr: Titre de la farde

source: Folder classification categories
fr: Codes de classement de la farde

source: Folder identifier
fr: Identifiant de la farde

source: Folder internal reference default value expression
fr: Farde: expression Tal définissant la valeur par défaut du champ Identifiant unique

source: Folder listing view
fr: Vue farde avec dashboard

source: Identifier
fr: Identifiant

source: Import folders
fr: Importation des dossiers

source: List of folders / subfolders in which this content is filed
fr: Liste des codes de classement associés

source: Name
fr: Titre

source: No
fr: Non

source: Number of next folder
fr: Farde: numéro du prochain élément

source: Number of next subfolder
fr: Chemise: numéro du prochain élément

source: Parent Identifier
fr: Identifiant du parent

source: Renaming of folder is not allowed
fr: Changer l'identifiant d'une farde ou chemise n'est pas autorisé !

source: Service in charge
fr: Service traitant

source: Service that will be set on all imported folders
fr: Ce service sera défini pour tous les dossiers importés.

source: Services in copy
fr: Services en copie

source: State or Filesize
fr: État / Taille

source: Subfolder Informations
fr: Informations de la chemise

source: Subfolder Name
fr: Titre de la chemise

source: Subfolder classification categories
fr: Codes de classement de la chemise

source: Subfolder identifier
fr: Identifiant de la chemise

source: Subfolder internal reference default value expression
fr: Chemise: expression Tal définissant la valeur par défaut du champ Identifiant unique

source: Tal expression where you can use portal, number, context, request, date as variable
fr: Expression Tal où les variables portal, number, context, request, date peuvent être utilisées

source: The classification identifier must be unique to this folder.
fr: L'identifiant de classification doit être unique à ce dossier.

source: This import may take a while depending of the number of elements. If the process is interrupted (e.g. by closing your browser) it can be resumed easely by starting import process again
fr: Ce processus d'import peut prendre un certain temps en fonction du nombre d'éléments. Si le processus est interrompu (par exemple en fermant le navigateur), il peut être repris facilement en recommençant le processus d'importation.

source: This value is used as 'number' variable in linked tal expression
fr: Cette valeur est utilisée en tant que variable 'number' dans l'expression Tal liée

source: Title
fr: Titre

source: Treating groups title
fr: Intitulé exact du service traitant

source: Yes
fr: Oui

source: You can't select both a treating_groups and a column associated to treating groups title
fr: Vous ne pouvez pas sélectionner à la fois une valeur pour le service traitant et une colonne associée à l'intitulé exact du service traitant

source: archived_0
fr: Non archivé

source: archived_1
fr: Archivé

source: cannot_delete_referenced_folder
fr: Ce dossier ne peut être supprimé car il est référencé autre part
