Repository: pypi-data/pypi-mirror-296
Catalog: packages/affinitic.smartweb/affinitic.smartweb-1.0.0a16.tar.gz/affinitic.smartweb-1.0.0a16/src/affinitic/smartweb/locales/*/LC_MESSAGES/affinitic.smartweb.po
Languages: fr

source: Display Attendee
fr: Afficher les participants

source: Display Contact Mail
fr: Afficher le mail de contact

source: Display Contact Name
fr: Afficher le nom de contact

source: Display Contact Phone
fr: Afficher le numéros de téléphone de contact

source: Display End Date
fr: Afficher la date de fin

source: Display Lead Image
fr: Afficher l'image de garde

source: Display Location
fr: Afficher la localisation

source: Display Open End
fr: Afficher si il n'y a pas d'heure de fin

source: Display Recurence
fr: Afficher la récurence

source: Display Start Date
fr: Afficher la date de début

source: Display Whole Day
fr: Afficher si ca se déroule toute la journée

source: Event
fr: Evenement

source: Event Folder
fr: Dossier d'évenement

source: Event Folder content type to structure website
fr: Type de contenu du dossier d'événements pour structurer le site Web

source: Event Page content type to print event informations
fr: Type de contenu de la page d'événement pour afficher les informations sur l'événement

source: Events Infos section
fr: Section Informations sur les événements

source: Events info section for a event
fr: Section d'informations sur les événements pour un événement

source: Events section
fr: Section événements

source: Events section for a page
fr: Section événements pour une page

source: Events view used to display events details
fr: Vue événements utilisée pour afficher les détails de l'événement

source: Maximum number of batches to display
fr: Nombre maximum de lots à afficher

source: News Folder
fr: Dossier d'actualités

source: News Folder content type to structure website
fr: Type de contenu du dossier Actualités pour structurer le site Web

source: News Item
fr: Actualité

source: News Page content type to print news informations
fr: Type de contenu de la page d'actualités pour afficher des informations d'actualité

source: News section
fr: Section actualités

source: News section for a page
fr: Section actualités pour une page

source: News view used to display news items details
fr: Vue actualités utilisée pour afficher les détails de l'actualité

source: No
fr: Non

source: Number of items per batch
fr: Nombre d'éléments par lot

source: See all events
fr: Voir tous les événements

source: See all news
fr: Voir toutes les actualités

source: Show items description
fr: Afficher la description des éléments

source: Text for the link to the events view
fr: Texte du lien vers la vue évévenements

source: Text for the link to the news view
fr: Texte du lien vers la vue actualités

source: Yes
fr: Oui
