Repository: pypi-data/pypi-mirror-296
Catalog: packages/deskmaid/deskmaid-2.0.1.tar.gz/deskmaid-2.0.1/deskmaid/locale/*/LC_MESSAGES/messages.po
Languages: fr

source: show program's version number and exit
fr: affiche la version du programme et quitte

source: desired action to perform
fr: action désirée à exécuter

source: verbose mode, enable INFO and DEBUG messages.
fr: mode verbeux, active les messages INFO et DEBUG

source: run deskmaid for clean your desktop.
fr: lance deskmaid pour nettoyer votre bureau.

source: do not move files.
fr: ne déplace pas les fichiers.

source: recursive arrange.
fr: rangement récursif.

source: path to the directory to arrange.
fr: chemin vers le répertoire à ranger.

source: undo the last run command.
fr: annule la dernière commande run.

source: create shortcuts on desktop.
fr: créer des raccoursis sur le bureau.

source: No command specified
fr: Aucune command spécifiée

source: Unexpected error
fr: Erreur innatendue

source: Please, report this error to %s.
fr: Merci de signaler cette erreur sur %s.

source: Invalid type %(type)r for %(value)r
fr: Le type %(type)r n'est pas valide pour %(value)r

source: Move %s to %s
fr: Déplace %s vers %s

source: Undo %s to %s
fr: Anullation de %s vers %s

source: At your command, senpai
fr: À vos ordres, senpai

source: one files arranged
fr: un fichier trié

source: Oni-chan, everything is tidy It's just the two of us now
fr: Oni-chan, tout est rangé Il ne reste plus que nous deux

source: Failed to send notification: %s
fr: Echec de l'envoie de la notification : %s

source: %(path)s is not a valid path
fr: %(path)s n'est pas un chemin valide

source: Configurable desktop cleaner.
fr: Nettoyeur de bureau configurable.

source: .__call__() not defined
fr: .__call__() n'est pas définit

source: unknown parser %(parser_name)r (choices: %(choices)s)
fr: parser inconnu %(parser_name)r (choix : %(choices)s

source: argument "-" with mode %r
fr: argument "-" avec mode %r

source: can't open '%(filename)s': %(error)s
fr: impossible d'ouvrir '%(filename)s' : %(error)s

source: cannot merge actions - two groups are named %r
fr: impossible de fusionner les actions - deux groupes ont le nom %r

source: 'required' is an invalid argument for positionals
fr: 'required' est un argument invalide pour les arguments positionnels

source: invalid option string %(option)r: must start with a character %(prefix_chars)r
fr: option %(option)r invalide : doit commencer par un caractère %(prefix_chars)r

source: dest= is required for options like %r
fr: dest= est requis pour les options comme %r

source: invalid conflict_resolution value: %r
fr: valeur invalide pour conflict_resolution : %r

source: conflicting option string: %s
fr: option en conflit : %s

source: mutually exclusive arguments must be optional
fr: des arguments mutuellement exclusifs doivent être optionnels

source: positional arguments
fr: arguments positionnels

source: options
fr: arguments optionnels

source: show this help message and exit
fr: affiche ce message et termine le programme

source: cannot have multiple subparser arguments
fr: impossible d'avoir plusieurs arguments de type subparser

source: unrecognized arguments: %s
fr: arguments non reconnus : %s

source: not allowed with argument %s
fr: interdit avec l'argument %s

source: ignored explicit argument %r
fr: argument explicite %r ignoré

source: the following arguments are required: %s
fr: les arguments suivants sont exigés : %s

source: one of the arguments %s is required
fr: un des arguments %s est exigé

source: expected one argument
fr: un argument est attendu

source: expected at most one argument
fr: au plus un argument est attendu

source: expected at least one argument
fr: au moins un argument est attendu

source: expected %s argument
fr: %s argument attendu

source: ambiguous option: %(option)s could match %(matches)s
fr: option ambiguë : %(option)s pourrait correspondre à %(matches)s

source: unexpected option string: %s
fr: option inattendue : %s

source: %r is not callable
fr: %r n'est pas appelable

source: invalid %(type)s value: %(value)r
fr: valeur %(type)s invalide : %(value)r

source: invalid choice: %(value)r (choose from %(choices)s)
fr: choix invalide : %(value)r (choix parmi %(choices)s

source: %(prog)s: error: %(message)s
fr: %(prog)s : erreur : %(message)s
